src/app/views/messages/index.html.erb

    <ul>
      <% user = User.find(message.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]