src/app/controllers/items_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = $1  [["item_id", 3]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."item_id" = $1  [["item_id", 3]]
---
  def show



   @items = Item.where(:category_id => @category_id)

   @comments = Comment.all

   @order_item = current_order.order_items.new