src/app/controllers/items_controller.rb

SELECT "items".* FROM "items"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
  def index
  	@items = Item.all
    @order_items = current_order.order_items.new

INSERT INTO "items" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-05-11 03:32:03.325589"], ["updated_at", "2020-05-11 03:32:03.325589"], ["user_id", 1]]
SELECT "categories".* FROM "categories"
---
  def new
  	 @item =  current_user.items.create
      #@oder_items = OrderItem.current_order.order_item.new

     @categories = Category.all.map{ |c| [c.name, c.id] }

INSERT INTO "items" ("title", "description", "size", "color", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", "item4"], ["description", ""], ["size", ""], ["color", ""], ["created_at", "2020-05-13 05:33:23.021844"], ["updated_at", "2020-05-13 05:33:23.021844"], ["user_id", 2], ["category_id", 1]]
INSERT INTO "items" ("title", "description", "size", "color", "price", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
   # @oder_items = OrdertIem.current_order.order_item.create(item_params)
  	@item = current_user.items.create(item_params)
     @item.category_id = params[:category_id]
  	if @item.save

SELECT "comments".* FROM "comments"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
  def show

   @comments = Comment.all

   @order_item = current_order.order_items.new

SELECT "categories".* FROM "categories"
UPDATE "items" SET "color" = $1, "price" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["color", ""], ["price", 100.0], ["updated_at", "2020-05-13 11:36:55.224056"], ["id", 5]]
---
  def update
    @categories = Category.all.map{ |c| [c.name, c.id] }
    if @item.update(item_params)

SELECT "categories".* FROM "categories"
---
   def edit
    @categories = Category.all.map{ |c| [c.name, c.id] }

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 3]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def destroy
  Item.find(params[:id]).destroy

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def find_item
    @item = Item.find(params[:id])