src/app/controllers/order_items_controller.rb

INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["subtotal", "0.0"], ["created_at", "2020-05-14 03:48:07.450720"], ["updated_at", "2020-05-14 03:48:07.450720"]]
UPDATE "orders" SET "subtotal" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["subtotal", "200.0"], ["updated_at", "2020-05-14 03:56:23.499503"], ["id", 3]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("quantity", "item_id", "order_id", "total", "unit_price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["subtotal", "0.0"], ["created_at", "2020-05-14 01:27:27.894276"], ["updated_at", "2020-05-14 01:27:27.894276"]]
---
	def create

        @order = current_order
        @order.save
        @order_item = @order.order_items.create(order_params)