app/controllers/comment_controller.rb

	def create

        Comment.create(user_id: current_user.id, item_id: params[:item_id], text_field: params[:text_field])
---
INSERT INTO "comments" ("text_field", "user_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text_field", "comment 1"], ["user_id", 1], ["item_id", 1], ["created_at", "2020-05-12 03:41:52.349501"], ["updated_at", "2020-05-12 03:41:52.349501"]]