src/app/views/items/show.html.erb

     <ul class ="comment-list">
        <li> <%= User.find(comment.user_id).email %> </li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]