src/app/views/items/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 3]]
---

 <%= link_to "#{current_order.order_items.size} items with a value of #{current_order.subtotal }$", cards_path%>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
     <ul class ="comment-list">
        <li> <%= User.find(comment.user_id).email %> </li>